public class Main {
    public static void main(String[] args) {

        int стоимость_билета = 17546;
        int рубли_в_одной_миле = 20;
        int количество_начисленных_миль_за_купленный_билет = стоимость_билета/рубли_в_одной_миле;

                System.out.println("За данный полёт будет начислено: " + количество_начисленных_миль_за_купленный_билет + "миль");
        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}